FILES/ChartsOfCharacteristicTypes/НаборХарактеристикДляНоменклатуры.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.5">
	<ChartOfCharacteristicTypes>
		<Properties>
			<Name>НаборХарактеристикДляНоменклатуры</Name>
			<Type>
				<v8:Type>cfg:CatalogRef.ФункцииОписания</v8:Type>
				<v8:Type>cfg:CatalogRef.ЭлементОтбора</v8:Type>
				<v8:Type>cfg:CatalogRef.ПроектБТ</v8:Type>
				<v8:Type>cfg:CatalogRef.Валюты</v8:Type>
				<v8:Type>xs:boolean</v8:Type>
				<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
				<v8:Type>cfg:CatalogRef.ВидыМест</v8:Type>
				<v8:Type>cfg:DocumentRef.СписокДопУслуг</v8:Type>
				<v8:Type>xs:string</v8:Type>
				<v8:Type>cfg:CatalogRef.СтавкиНДСБТ</v8:Type>
				<v8:Type>cfg:CatalogRef.Места</v8:Type>
				<v8:Type>cfg:CatalogRef.Командированные</v8:Type>
				<v8:Type>xs:dateTime</v8:Type>
				<v8:Type>xs:decimal</v8:Type>
				<v8:Type>cfg:EnumRef.ФормыОплаты</v8:Type>
				<v8:Type>cfg:DocumentRef.Услуга</v8:Type>
				<v8:Type>cfg:EnumRef.СтатусыУслуг</v8:Type>
				<v8:Type>cfg:CatalogRef.НоменклатураБТ</v8:Type>
				<v8:Type>cfg:EnumRef.СтавкиНДС</v8:Type>
				<v8:NumberQualifiers>
					<v8:Digits>15</v8:Digits>
					<v8:FractionDigits>2</v8:FractionDigits>
				</v8:NumberQualifiers>
				<v8:StringQualifiers>
					<v8:Length>250</v8:Length>
				</v8:StringQualifiers>
				<v8:DateQualifiers>
					<v8:DateFractions>DateTime</v8:DateFractions>
				</v8:DateQualifiers>
			</Type>
			<Hierarchical>true</Hierarchical>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>КлючПоиска</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НаименованиеJSON</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>255</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ФункцияПоУмолчанию</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ФункцииОписания</v8:Type>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</ChartOfCharacteristicTypes>
</MetaDataObject>

FILES/ChartsOfCharacteristicTypes/НаборХарактеристикДляНоменклатуры/Ext/ManagerModule.bsl
Функция ЗагрузитьПредопределенныеЗначения() Экспорт
	
	Макет = ПланыВидовХарактеристик.НаборХарактеристикДляНоменклатуры.ПолучитьМакет("ПредопределенныеЗначения");
	
	ТекущаяСтрока = 1;
	ВыполнятьЗагрузку = Истина;
	Пока ВыполнятьЗагрузку Цикл
		ТекущаяСтрока = ТекущаяСтрока + 1;
		
		ИмяПредопределенного = Макет.Область(ТекущаяСтрока, 1, ТекущаяСтрока, 1).Текст;
		Наименование = Макет.Область(ТекущаяСтрока, 2, ТекущаяСтрока, 2).Текст;
		НаименованиеJSON = Макет.Область(ТекущаяСтрока, 3, ТекущаяСтрока, 3).Текст;
		ФункцияПоУмолчанию = Макет.Область(ТекущаяСтрока, 4, ТекущаяСтрока, 4).Текст;
		ТипСтрокой = Макет.Область(ТекущаяСтрока, 5, ТекущаяСтрока, 5).Текст;
		
		ФункцияПоУмолчаниюСсылка = Справочники.ФункцииОписания.ПустаяСсылка();
		Если ФункцияПоУмолчанию<>"" Тогда 
			ФункцияПоУмолчаниюСсылка = Справочники.ФункцииОписания[ФункцияПоУмолчанию];
		КонецЕсли;
		
		Если ИмяПредопределенного = "" Тогда
			ВыполнятьЗагрузку = Ложь;
		Иначе
			Попытка
				//Метаданные.Справочники.ФункцииОписания.Предопределенные
				ЭлементСправочника = ПланыВидовХарактеристик.НаборХарактеристикДляНоменклатуры[ИмяПредопределенного].ПолучитьОбъект();
				Если Наименование <> "" Тогда
					ЭлементСправочника.Наименование = Наименование;
				КонецЕсли;
				ЭлементСправочника.НаименованиеJSON = НаименованиеJSON;
				ЭлементСправочника.ФункцияПоУмолчанию = ФункцияПоУмолчаниюСсылка;
				
				Массив = Новый Массив;
				Массив.Добавить(Тип(ТипСтрокой));
				Если ТипСтрокой = "Число" Тогда
					КЧ = Новый КвалификаторыЧисла(15,2);
					ОписаниеТипов = Новый ОписаниеТипов(Массив, , ,КЧ);
				ИначеЕсли ТипСтрокой = "Строка" Тогда
					КС = Новый КвалификаторыСтроки(250);
					ОписаниеТипов = Новый ОписаниеТипов(Массив, , КС);
				Иначе
					ОписаниеТипов = Новый ОписаниеТипов(Массив);
				КонецЕсли;
				ЭлементСправочника.ТипЗначения = ОписаниеТипов;
				
				ЭлементСправочника.Записать();
			Исключение
				Сообщить(ОписаниеОшибки());
			КонецПопытки;
		КонецЕсли;
			
	КонецЦикла;
	
КонецФункции




Функция ПолучитьСтруктуруJSON() Экспорт
	
	Результат = Новый Структура();
	Макет = ПланыВидовХарактеристик.НаборХарактеристикДляНоменклатуры.ПолучитьМакет("ПредопределенныеЗначения");
	
	ТекущаяСтрока = 1;
	ВыполнятьЗагрузку = Истина;
	Пока ВыполнятьЗагрузку Цикл
		ТекущаяСтрока = ТекущаяСтрока + 1;
		
		Ключ = Макет.Область(ТекущаяСтрока, 1, ТекущаяСтрока, 1).Текст;
		Значение = Макет.Область(ТекущаяСтрока, 3, ТекущаяСтрока, 3).Текст;
		ИмяФункции = Макет.Область(ТекущаяСтрока, 4, ТекущаяСтрока, 4).Текст;
		
		Если Ключ = "" Тогда
			ВыполнятьЗагрузку = Ложь;
		Иначе
			Попытка
				Если ИмяФункции <> "" Тогда
					СсылкаНаФункцию = Справочники.ФункцииОписания[ИмяФункции];
				Иначе
					СсылкаНаФункцию = Справочники.ФункцииОписания.ПустаяСсылка();
				КонецЕсли;
				
				Результат.Вставить(ПланыВидовХарактеристик.НаборХарактеристикДляНоменклатуры[Ключ], Новый Структура("Реквизит, КакЗаполнять", Значение, СсылкаНаФункцию));
			Исключение
			КонецПопытки;
		КонецЕсли;
			
	КонецЦикла;
	
	Возврат Результат;
	
КонецФункции

Функция ПолучитьСтруктуруРеквизитов() Экспорт
	
	Результат = Новый Структура();
	Макет = ПланыВидовХарактеристик.НаборХарактеристикДляНоменклатуры.ПолучитьМакет("ПредопределенныеЗначения");
	
	ТекущаяСтрока = 1;
	ВыполнятьЗагрузку = Истина;
	Пока ВыполнятьЗагрузку Цикл
		ТекущаяСтрока = ТекущаяСтрока + 1;
		
		Ключ = Макет.Область(ТекущаяСтрока, 3, ТекущаяСтрока, 3).Текст;
		Значение = Макет.Область(ТекущаяСтрока, 1, ТекущаяСтрока, 1).Текст;
		ИмяФункции = Макет.Область(ТекущаяСтрока, 4, ТекущаяСтрока, 4).Текст;
		
		Если Ключ = "" Тогда
			ВыполнятьЗагрузку = Ложь;
		Иначе
			Попытка
				Если ИмяФункции <> "" Тогда
					СсылкаНаФункцию = Справочники.ФункцииОписания[ИмяФункции];
				Иначе
					СсылкаНаФункцию = Справочники.ФункцииОписания.ПустаяСсылка();
				КонецЕсли;
				
				Результат.Вставить(Ключ, Новый Структура("Реквизит, ФункцияПоУмолчанию", ПланыВидовХарактеристик.НаборХарактеристикДляНоменклатуры[Значение], СсылкаНаФункцию));
			Исключение
			КонецПопытки;
		КонецЕсли;
			
	КонецЦикла;
	
	Возврат Результат;
	
КонецФункции
